{
  "homepage": "https://minecraft.curseforge.com/projects/roots-classic",
  "promos": {
    "1.16.5-latest": "1.1.10",
    "1.20.1-latest": "1.3.0"
  },
  "1.16.5":{
	  "1.0.0":"Initial Release"
  	,"1.0.1":"Clicking a Mortar recipe now displays it in chat as a helpful reminder.  Fixed particle transparency.  Added forge update checker hook.  Added in-game Config GUI setup; 1.0.0 config file is no longer compatible, (suggested you delete config from 1.0.0 to avoid duplicate entries.  This will not happen again in future releases).  Added tooltips to a few items.   Casting Altar now correctly triggers from player sneak-activating, and gives warning message if ritual invalid.  Fixed some berries not having a use.  Living tools now use gold nugget instead of ingot.  Berries now drop from all six vanilla tree leaves not just oak.  "
  	,"1.0.2":"Infernal bulbs no longer get eaten when used on a skeleton.  Removed restriction of Crystal Staff only working on vanilla grass blocks.   More config controls added.  You can now remove items from the mortar using an empty hand.  Mortar gives you a status message if recipe is invalid.   Fixed a crash when a Staff runs out of durability.  Fixed Devil's Flower spell not spawning a skeleton.    "
  	,"1.0.3":"Fixed a startup crash compatibility issue with ERZ.  "
  	,"1.1.0":"Status messages while setting up rituals for ease of use.  Ritual ingredients are now unique.  If your ritual is invalid, you get status-bar messages to get a better idea of what is missing.  When you start a ritual, if all ingredients are valid it will auto-light the braziers for you.  Clicking a Ritual Altar recipe page now sends ingredients to chat to match how other recipes do it.  Full CraftTweaker (zenscript) support to change items used by all spells and rituals.  Item Tooltips added to all items rendered in the Runic Tablet GUI screens.  Vanilla crafting recipes are no longer shown in the Runic Tablet; this was changed to stay consistent with Craft Tweaker and JEI.  New Fruit salad food item to give berries more uses. "
   	,"1.1.1":"Fix crash on startup.  Duplicate items from zenscript reported to log.  "
  	,"1.1.2":"Zenscript support added for custom recipe crafting rituals, see the example files (https://github.com/Lothrazar/RootsClassic/tree/develop/scripts_zen_example).  Also more support for customizing existing  rituals.  Updated saturation of food items.  Regeneration spell no longer tries to set player movement to zero (also fixes server issue).  "
  	,"1.1.3":"Fixed Living Shovel not repairing.  Fixed healing not triggering on full set of Wildwood Armor.  Fixed Growth powder.  Fixed Growing Stone not affecting lily pads or crops.  Growth stone radius reduced, speed reduced, locations randomized and power increased.     "
  	,"1.1.4":"Fixed mortar recipes not activating.  Added two new text responses from mortar if the recipe is invalid, or if its invalid but is missing a rare material (such as old root).  Fixed Mortar not saving its contents on world reload.  "
  	,"1.1.5":"Growth Powder and Growth Standing Stone no longer act as bonemeal to spam tallgrass on grass blocks.  Growth Powder and Growth Standing Stone updated growth strategy to be more compatible with other mods such as Restrictions: https://www.curseforge.com/minecraft/mc-mods/plant-biomes  "
  	,"1.1.6":"Updated to latest forge and forge-mappings (14.23.5.2847).  Fixed log spam from some rituals.  Fixed Texture error in Growing standing stone.    by Laike-Endaril : Fix Calling client code on a server ; applies to all decayable leaves; fix Mortor not crafting spell recipe due to ghost item, Fix Berries only drop from vanilla leaves, Fix no whitelist/blacklist  "
  	,"1.1.7":"Fixed mana bar not visible"
  	,"1.1.8":"[MrBysco] Fix the altar shape allowing xray.  Fix particles crashing on dedicated servers.  "
  	,"1.1.9":"[MrBysco] Fix the tablet not displaying the Standing Stones required.  Fix item withdraw issue from third item slot in Altar.  Fix item dupe.    "
  	,"1.1.10":"[MrBysco] Fix enchanting roots armor crashing the game.    "
  }	,
  
  "1.20.1":{
  	"1.3.0": "Ported to 1.20.1 along with flib-0.0.7.  Main config is now named 'rootsclassic.toml' (old name was rootsclassic-common.toml).  Bark knife now has a tooltip.  Moved to non-deprecated SpawnPlacement events.  Rituals & components are now defined with JSON recipes  (Merge pull request #96 from PssbleTrngle/feature/data-rituals Data-driven rituals).   Merge pull request #94 from Mr-Ao-Dragon/Mr-Ao-Dragon-patch-1    add chinese tran file.  (Merge pull request #94 from Mr-Ao-Dragon/Mr-Ao-Dragon-patch-1)    Translate into Russian. [MrBysco] Ported to 1.19.2, 1.19.3, 1.19.4, 1.20"
  	,"1.3.1": "Nightshade and Elderberry can now be put in the (vanilla) Composter "
  }
}